{"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 30, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "TCN", "config": {"name": "TCN", "trainable": true, "dtype": "float32", "nb_filters": 25, "kernel_size": 2, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32, 64, 128], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.0, "return_sequences": false, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": true, "kernel_initializer": "he_normal"}, "name": "TCN", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 20, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["TCN", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}